# St7SetCreepConcreteShrinkageType

Sets the shrinkage type assigned to the specified creep law definition.

long St7SetCreepConcreteShrinkageType(long uID, long CreepID, long ShrinkageType)
Input Parameters
uID
Strand7 model file ID.
CreepID
Creep layout ID.
ShrinkageType
Either crCreepShrinkageTable or crCreepShrinkageFormula.